app/Controllers/Forum.php

SELECT *
FROM `posts`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new PostModel();
        $data['posts'] = $model->orderBy('created_at', 'DESC')->findAll();

INSERT INTO `posts` (`author_name`, `title`, `content`) VALUES ('user123', 'ganon tagala', 'gaon takaga')
---
 public function store()
{
    $model = new PostModel();

    $authorName = session()->get('logged_in')
        ? session()->get('username')
        : $this->request->getPost('author_name');

    $data = [
        'author_name' => $authorName,
        'title'       => $this->request->getPost('title'),
        'content'     => $this->request->getPost('content'),
    ];

    $model->insert($data);